<?php
// +----------------------------------------------------------------------
// | ThinkBiz System
// | 商城模块通用函数库
// +----------------------------------------------------------------------
// | 版权所有 2013~2017 深圳市俊网网络有限公司 [ http://www.junnet.net ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.junnet.net
// +----------------------------------------------------------------------
// | 作者: 余剑华 <528526198@qq.com>
// +----------------------------------------------------------------------
use think\Db;

/**
 * 优惠券类加载函数
 * @return
 */
function coupon(){
    $coupon = new app\shop\api\Coupon();
    return $coupon;
}


/**
 * 获取订单状态名称
 * @param int $status 订单状态
 * @return array
 */
function getOrderStatusName($status)
{
    $config = config('order_status');

    return $config[$status];
}