<?php
// +----------------------------------------------------------------------
// | ThinkBiz System
// | 商城模块配置文件
// +----------------------------------------------------------------------
// | 版权所有 2013~2017
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 作者: 余剑华 <528526198@qq.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------
    'flash_times' => [
        '08:00','10:00','14:00','18:00'
    ],

    'sex' => ['保密','男','女'],
	'order_status' => [
	    '-3' => '已作废',
        '-2' => '无效订单',
        '-1' =>	'已删除',
		'0'	=>	'已取消',
        '1'	=>	'未支付',
		'2' => 	'已支付，待确认',
		'3' => 	'已确认，待发货',
		'4' => 	'已发货，待收货',
		'5' => 	'已收货，待评价',
 		'6' => 	'已完成',
	],
	'shipping_status' => [
		'0' =>	'未发货',
		'1' =>	'已发货',
		'2' =>	'部分发货',
	],
	'pay_status' => [
		'0'	=>	'未支付',
		'1'	=>	'已支付',
	],
    //优惠方式
    'discount_type' => [
        '1' => '折扣券',
        '2' => '金额券',
        '3' => '积分券',
        '4' => '代金券',
        '5' => '免邮券',
    ],
    // 退货原因
    'return_reason' => [
        '不想买了' => '不想买了',
        '快递物流一直未送到' => '快递物流一直未送到',
        '质量问题' => '质量问题',
        '商品与描述不符' => '商品与描述不符',
        '误购（不喜欢/大小不合适）' => '误购（不喜欢/大小不合适）',
        '卖家发错货' => '卖家发错货',
        '发票问题' => '发票问题',
        '其他' => '其他',
    ],
    //退货
    'return_goods' => [
        '-2' => '退回买家',//未达到退货要求，退回买家
        '-1' => '卖家拒绝',//卖家拒绝退货
        '0' => '用户取消',
        '1' => '待卖家处理',
        '2' => '待买家退货',
        '3' => '待卖家收货',
        '4' => '待卖家退款',
        '5' => '退货完成',
    ],
    // 默认跳转页面对应的模板文件
    'dispatch_success_tmpl'  => ROOT_PATH . 'themes/' . tb_config('web_template',1) . '/mshop/public/dispatch_jump.html',
    'dispatch_error_tmpl'    => ROOT_PATH . 'themes/' . tb_config('web_template',1) . '/mshop/public/dispatch_jump.html',
];