<?php
// +----------------------------------------------------------------------
// | ThinkBiz System
// | 功能： 门户模块内容控制器 
// +----------------------------------------------------------------------
// | 版权所有 2013~2017     
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 作者:
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
return [
    // 模块名[必填]
    'name'        => 'mshop',
    // 模块标题[必填]
    'title'       => '{"zh-cn":"商城手机端","en-us":"MobileSHOP"}',
    // 模块唯一标识[必填]，格式：模块名.开发者标识.module
    'identifier'  => 'mshop.TBMALL.module',
    // 模块图标[选填]
    'icon'        => 'fa fa-fw fa-shopping-cart',
    // 模块描述[选填]
    'description' => '商城模块',
    // 开发者[必填]
    'author'      => 'TBMALL',
    // 开发者网址[选填]
    'author_url'  => '/',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    'version'     => '1.0.0',
    // 是否为系统模块[必填]，默认为否
    'system_module'     => '0',
	// 是否在后台插件管理中显示
    'is_manage'     => '0',
	 // 数据表[有数据库表时必填]
    'tables' => [
    ],
    // 原始数据库表前缀
    // 用于在导入模块sql时，将原有的表前缀转换成系统的表前缀
    // 一般模块自带sql文件时才需要配置
    'database_prefix' => 'tb_',
];
