<?php
// +----------------------------------------------------------------------
// | ThinkBiz System
// +----------------------------------------------------------------------
// | 版权所有 2013~2017 深圳市俊网网络有限公司 [ http://www.junnet.net ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.junnet.net
// +----------------------------------------------------------------------
// | 作者: 余剑华 <528526198@qq.com>
// +----------------------------------------------------------------------

// [ PHP版本检查 ]
header("Content-type: text/html; charset=utf-8");
if (version_compare(PHP_VERSION, '5.5', '<')) {
    die('PHP版本过低，最少需要PHP5.5，请升级PHP版本！');
}

// 定义应用目录
define('APP_PATH', __DIR__ . '/../application/');

// 定义浏览器公共访问目录
define('PUBLIC_PATH','/');

// 定义入口为admin
define('ENTRANCE', 'admin');
// define('BIND_MODULE', 'admin');

// 加载框架引导文件
require __DIR__ . '/../ebiz/start.php';